cf_billing/DataProcessors/энргМенеджерАвансы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргМенеджерАвансы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргАвансы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргАвансы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Documents/энргНачислениеПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргНачислениеПени</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоПени</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыИспользованные</xr:Item>
				<xr:Item>AccumulationRegister.энргНачислениеПени</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыПоступившие</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансы</xr:Item>
				<xr:Item>InformationRegister.энргВыполненныеНачисленияПени</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьДанныеНачислений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗадолженности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаРефинансирования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаНачисленияПени</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПросрочкиСДатыНачалаНачисленийПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЧислитель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЗнаменатель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачисленияПени</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/DataProcessors/энргМенеджерАвансы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция РезультатАвансыНаГраницуСбитойПоследовательности(МВТ, ОписаниеОтборов, ГраницыПериода) Экспорт 
	
	СхемаЗапроса 	 = Новый СхемаЗапроса;
	ПараметрыСхемы 	 = Новый Структура;
	ПараметрыЗапроса = Новый Структура;	
	
	ПараметрыВТ		= Новый Массив;
	ОтборыВСписке	= Новый Структура;
	Отборы = Новый Структура;
	Отборы.Вставить("Организация", "Организация");
	Отборы.Вставить("Район"		 , "Район");
			
	Если НЕ ОписаниеОтборов.МКД = Неопределено Тогда 
		Отборы.Вставить("МКД", "МКД");
		ПараметрыЗапроса.Вставить("МКД", ОписаниеОтборов.МКД);
	КонецЕсли;
	
	Если ОписаниеОтборов.Свойство("СписокМКД") И НЕ ОписаниеОтборов.СписокМКД = Неопределено Тогда 
		ОтборыВСписке.Вставить("МКД", "СписокМКД");
		ПараметрыЗапроса.Вставить("СписокМКД", ОписаниеОтборов.СписокМКД);
	КонецЕсли;
	
	Если НЕ ОписаниеОтборов.Абонент = Неопределено Тогда 
		Отборы.Вставить("Абонент", "Абонент");
		ПараметрыЗапроса.Вставить("Абонент", ОписаниеОтборов.Абонент);
	КонецЕсли; 
	
	Если ОтборыВСписке.Количество() <> 0 Тогда 
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(ОтборыВСписке));	
	КонецЕсли;
	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Отборы));	
	ПараметрыСхемы.Вставить("ПараметрыВТ"	, ПараметрыВТ);
	ПараметрыСхемы.Вставить("Период"		, энргФормированиеТекстовЗапроса.ПараметрПериодРавно("НачалоПериодаРасчета"));
	ПараметрыСхемы.Вставить("НачалоПериода"	, энргФормированиеТекстовЗапроса.ПараметрПериодРавно("НачалоПериодаРасчета"));
	ПараметрыСхемы.Вставить("КонецПериода"	, энргФормированиеТекстовЗапроса.ПараметрПериодРавно("КонецПериодаРасчета"));
	
	РегистрыНакопления.энргАвансы.ЗаполнитьСхемуОстаткиНаМоментВремени(СхемаЗапроса, ПараметрыСхемы, "АвансыОстатки");
	РегистрыНакопления.энргАвансы.ЗаполнитьСхемуОборотыЗаПериод(СхемаЗапроса, ПараметрыСхемы, "АвансыОбороты");
	СформироватьИтоговуюВыборкуАвансыНаГраницуСбитойПоследовательности(СхемаЗапроса);	
	
	ПараметрыЗапроса.Вставить("Организация"			, ОписаниеОтборов.Организация);
	ПараметрыЗапроса.Вставить("Район"				, ОписаниеОтборов.Район);
	ПараметрыЗапроса.Вставить("МКД"					, ОписаниеОтборов.МКД);
	ПараметрыЗапроса.Вставить("Абонент"				, ОписаниеОтборов.Абонент);
	ПараметрыЗапроса.Вставить("НачалоПериодаРасчета", ГраницыПериода.НачалоПериодаРасчета);
	ПараметрыЗапроса.Вставить("КонецПериодаРасчета"	, ГраницыПериода.КонецПериодаРасчета);
	
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(СхемаЗапроса, ПараметрыЗапроса, МВТ);
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьИтоговуюВыборкуАвансыНаГраницуСбитойПоследовательности(СхемаЗапроса)
	
	Пакет = СхемаЗапроса.ПакетЗапросов.Добавить(); 	
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.МКД КАК МКД,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ДокументОплаты КАК ДокументОплаты,
	|	ВложенныйЗапрос.Разделитель КАК Разделитель,
	|	СУММА(ВложенныйЗапрос.СуммаАванса) КАК СуммаАванса,
	|	ВложенныйЗапрос.ЖивыеДеньги КАК ЖивыеДеньги

	|ИЗ
	|	(ВЫБРАТЬ
	|		РазличныеАбоненты.Организация КАК Организация,
	|		РазличныеАбоненты.ПериодНачисления КАК ПериодНачисления,
	|		РазличныеАбоненты.Район КАК Район,
	|		РазличныеАбоненты.МКД КАК МКД,
	|		РазличныеАбоненты.Абонент КАК Абонент,
	|		АвансыОстатки.ДокументОплаты КАК ДокументОплаты,
	|		АвансыОстатки.Разделитель КАК Разделитель,
	|		АвансыОстатки.СуммаОстаток КАК СуммаАванса,
	|		АвансыОстатки.ЖивыеДеньги КАК ЖивыеДеньги
	|	ИЗ
	|		РазличныеАбоненты КАК РазличныеАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОстатки КАК АвансыОстатки
	|			ПО РазличныеАбоненты.Район = АвансыОстатки.Район
	|				И РазличныеАбоненты.МКД = АвансыОстатки.МКД
	|				И РазличныеАбоненты.Абонент = АвансыОстатки.Абонент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МинимумРегистратор.Организация,
	|		МинимумРегистратор.ПериодНачисления,
	|		МинимумРегистратор.Район,
	|		МинимумРегистратор.МКД,
	|		МинимумРегистратор.Абонент,
	|		АвансыОбороты.ДокументОплаты,
	|		АвансыОбороты.Разделитель,
	|		СУММА(АвансыОбороты.СуммаОборот),
	|		АвансыОбороты.ЖивыеДеньги 
	|	ИЗ
	|		МинимумРегистратор КАК МинимумРегистратор
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ АвансыОбороты КАК АвансыОбороты
	|			ПО (ВЫБОР
	|					КОГДА МинимумРегистратор.ДопПорядок = 10  
	|						ТОГДА 
	|							ВЫБОР 
	|								КОГДА АвансыОбороты.Регистратор ССЫЛКА Документ.энргНачислениеПени 
	|									ТОГДА ЛОЖЬ 
	|								ИНАЧЕ ИСТИНА 
	|							КОНЕЦ
	|					КОГДА МинимумРегистратор.ДатаРегистратора > АвансыОбороты.Период
	|						ТОГДА ИСТИНА
	//|					КОГДА МинимумРегистратор.ДатаРегистратора = АвансыОбороты.Период
	//|						ТОГДА ВЫБОР
	//|								КОГДА МинимумРегистратор.ДопПорядок = 0
	//|										И АвансыОбороты.Регистратор ССЫЛКА Документ.энргНачисление
	//|									ТОГДА ЛОЖЬ
	//|								КОГДА МинимумРегистратор.ДопПорядок = 10
	//|									ТОГДА АвансыОбороты.Регистратор ССЫЛКА Документ.энргНачислениеПени
	//|								ИНАЧЕ МинимумРегистратор.ДокРегистратор > АвансыОбороты.Регистратор
	//|										ИЛИ АвансыОбороты.Регистратор ССЫЛКА Документ.энргНачислениеПени
	//|							КОНЕЦ
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ)
	|				И МинимумРегистратор.Район = АвансыОбороты.Район
	|				И МинимумРегистратор.МКД = АвансыОбороты.МКД
	|				И МинимумРегистратор.Абонент = АвансыОбороты.Абонент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МинимумРегистратор.Организация,
	|		МинимумРегистратор.ПериодНачисления,
	|		МинимумРегистратор.Район,
	|		МинимумРегистратор.МКД,
	|		МинимумРегистратор.Абонент,
	|		АвансыОбороты.ДокументОплаты,
	|		АвансыОбороты.Разделитель,
	|		АвансыОбороты.ЖивыеДеньги) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.ПериодНачисления,
	|	ВложенныйЗапрос.Район,
	|	ВложенныйЗапрос.МКД,
	|	ВложенныйЗапрос.Абонент,
	|	ВложенныйЗапрос.ДокументОплаты,
	|	ВложенныйЗапрос.Разделитель,
	|	ВложенныйЗапрос.ЖивыеДеньги
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПериодНачисления,
	|	Район,
	|	МКД,
	|	Абонент,
	|	ДокументОплаты,
	|	Разделитель");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
